docs: DIS-133 and DIS-134 plus copyediting (#1439)
Signed-off-by: Kristen Kelleher <kkelleher@nvidia.com>
Co-authored-by: Ryan McCormick <rmccormick@nvidia.com>
